In [1]:
print("sapna")

sapna

In [3]:
print("i love self")

i love self

In [4]:
import pandas as pd
df=pd.read_csv("practice1.csv")
print(df)

     EMP_ID     name  age  gender  degination  sallary   city      country  \
0    EMP001   vikash   22    male       owner     8000     mp        india
1    EMP002    sapna   21  female     manager    60000  bihar          usa
2    EMP003      ram   34    male      cahier    70000  delhi        india
3    EMP004  krishna   32    male   accounter    56000  delhi        china
4    EMP005    seeta   43  female    engineer    40000   pune      newyork
5    EMP006    radha   45  female  programmer    50000  rachi        korea
6    EMP007    mohan   26    male      tester    66000  rachi  switzerland
7    EMP008    shyam   29    male  programmer    45000  delhi        india
8    EMP009  hanuman   31    male      tester    85000    goa        india
9   EMP0010    meena   29  female      cahier    80000  delhi          usa
10   EMP002    sapna   21  female     manager    60000  bihar         irak
11   EMP004  krishna   32    male     teacher    45000  delhi        korea

    bonus
0    0.50
1    0.00
2    5.00
3    0.67
4    0.00
5    0.45
6    0.30
7    0.80
8    0.00
9    0.70
10   0.90
11   0.40

In [1]:
import pandas as pd
data=pd.read_csv("student.csv")
print(data)

  emp_id firstname  lastname  sallary gender
0    em1     sapna       sah    40000      f
1    em2    vikash  kushwaha    70000      m
2    em3     pooja    kumari    60000      f
3    em4     sagar     rawat    60000      m
4    em5     niket       raj    30000      m
5    em6      rani    thakur    50000      f

In [10]:
data["fullname"]=data["firstname"].str.upper()+" "+data["lastname"]
print(data)

  emp_id firstname  lastname  sallary gender    Bonus         fullname
0    em1     sapna       sah    40000      f   8000.0        SAPNA sah
1    em2    vikash  kushwaha    70000      m  14000.0  VIKASH kushwaha
2    em3     pooja    kumari    60000      f  12000.0     POOJA kumari
3    em4     sagar     rawat    60000      m  12000.0      SAGAR rawat
4    em5     niket       raj    30000      m   6000.0        NIKET raj
5    em6      rani    thakur    50000      f  10000.0      RANI thakur

In [12]:
data["fullname"]=data["firstname"].str.capitalize()+" "+data["lastname"]
print(data)

  emp_id firstname  lastname  sallary gender    Bonus         fullname
0    em1     sapna       sah    40000      f   8000.0        Sapna sah
1    em2    vikash  kushwaha    70000      m  14000.0  Vikash kushwaha
2    em3     pooja    kumari    60000      f  12000.0     Pooja kumari
3    em4     sagar     rawat    60000      m  12000.0      Sagar rawat
4    em5     niket       raj    30000      m   6000.0        Niket raj
5    em6      rani    thakur    50000      f  10000.0      Rani thakur

In [13]:
data["fullname"]=data["firstname"].str.capitalize()+" "+data["lastname"].str.capitalize()
print(data)

  emp_id firstname  lastname  sallary gender    Bonus         fullname
0    em1     sapna       sah    40000      f   8000.0        Sapna Sah
1    em2    vikash  kushwaha    70000      m  14000.0  Vikash Kushwaha
2    em3     pooja    kumari    60000      f  12000.0     Pooja Kumari
3    em4     sagar     rawat    60000      m  12000.0      Sagar Rawat
4    em5     niket       raj    30000      m   6000.0        Niket Raj
5    em6      rani    thakur    50000      f  10000.0      Rani Thakur

In [14]:
data["Bonus"]=(data["sallary"]/100)*20
print(data)

  emp_id firstname  lastname  sallary gender    Bonus         fullname
0    em1     sapna       sah    40000      f   8000.0        Sapna Sah
1    em2    vikash  kushwaha    70000      m  14000.0  Vikash Kushwaha
2    em3     pooja    kumari    60000      f  12000.0     Pooja Kumari
3    em4     sagar     rawat    60000      m  12000.0      Sagar Rawat
4    em5     niket       raj    30000      m   6000.0        Niket Raj
5    em6      rani    thakur    50000      f  10000.0      Rani Thakur

In [20]:
data={"months":["january","february","march","april"]}
data=pd.DataFrame(data)
print(data)

     months
0   january
1  february
2     march
3     april

In [26]:
data={"months":["january","february","march","april","may","june","july","august"]}
a=pd.DataFrame(data)
print(a)
def extract(value):
    return value[0:6]
a["short_months"]=a["months"].map(extract)
print(a)

     months
0   january
1  february
2     march
3     april
4       may
5      june
6      july
7    august
     months short_months
0   january       januar
1  february       februa
2     march        march
3     april        april
4       may          may
5      june         june
6      july         july
7    august       august